package Part_four_SpringMVC;

public class Lesson_34_SpringMVCMeeting {

    // Мы начинаем новую, большую и интересную тему.

    // В промышленном программировании почти все завязано на шаблоны. Со стороны кажется, что сидят
    // люди, выдумывают новую программу, потом выдумывают как ее написать и пишут.
    // Это работает совсем не так. Нет смысла тратить время и ресурсы на разработку того, что
    // уже давно было придумано до нас. MVC это и есть шаблон проектирования.

    //  MVC - Model View Controller, это три компонента, которые вместе представляют шаблон
    // разработки программы.
    // Model - компонент, отвечающий за данные приложения и за работу с этими данными.
    // Как мы помним в основном данные хранятся в базах данных.
    // View - представление, компонент, отвечающий за взаимодействие с пользователем. Отображает данные
    // и определяет внешний вид приложения.
    // Controller - компонент, отвечающий за связь между View и Model. Именно здесь сосредоточена
    // бизнес-логика приложения. Мозг приложения.

    // SpringMVC - это фреймворк для создания веб-приложений на java в основе которого лежит шаблон
    // проектирования MVC. Включает в себя весь функционал Spring.

    // Из чего состоит Spring MVC приложение:
    // Конфигурация Spring
    // Описание Spring бинов
    // WEB страницы
}
